content/main/20211011015906-self_learning_machine.md
+++
title = "Self-Learning Machine"
author = ["System Administrator"]
draft = false
+++

## Self-Learning Machine {#self-learning-machine}

This machine is for complete self-learning
This machine stands alone and can be use for non-academic purpose.


### Principles {#principles}

<!--list-separator-->

-  Ahead of time(prepare)

    The self learning must be done at least `2 day` before the Tutoring take place or any usage of the learned content, because the learning works 2 days after

<!--list-separator-->

-  Self awareness(feedback)

    self-learning can easily fall into meaningless grinding without consciousness about what is being done.
    Having self awareness is crucial, and can be achived with feedback from myself.
    This implies that [Log Machine]({{< relref "20211007132712-log_machine.md" >}}) should be applied in the self-learning machine

<!--list-separator-->

-  Review(distributed exposure)

    Repeat sticks.
    When mentioned hear, reviewing refer to not spaced repetition, which is a method for fact learning, but refer to the review to the 1d, 7d, 14d, 30d cycle. 艾宾浩斯遗忘曲线。
    This implies that [Review Machine]({{< relref "20211011014207-review_machine.md" >}}) should be applied.

<!--list-separator-->

- <span class="org-todo todo TODO">TODO</span>  can check on Ultralearning Principles.

    ultralearning principles can be useful for self-learning machine


### Submachines {#submachines}

self-learning is a huge topic. according to the content and goals, the flow and selection of machines would also vary.


#### [Review Machine]({{< relref "20211011014207-review_machine.md" >}}) {#review-machine--20211011014207-review-machine-dot-md}


#### [Spaced Repetition]({{< relref "20211011020259-spaced_repetition.md" >}}) {#spaced-repetition--20211011020259-spaced-repetition-dot-md}


#### [Feynman Techinique]({{< relref "20211011020236-feynman_techinique.md" >}}) {#feynman-techinique--20211011020236-feynman-techinique-dot-md}


#### [Log Machine]({{< relref "20211007132712-log_machine.md" >}}) {#log-machine--20211007132712-log-machine-dot-md}


#### [Study Methods]({{< relref "20211101141207-study_methods.md" >}}) {#study-methods--20211101141207-study-methods-dot-md}


####  {#d41d8c}


#### Active Recall {#active-recall}


### Flow {#flow}

order of the machines call, and flow of action&amp;data.


#### Preview {#preview}

Preview is a flow particularly relevent to [Academic Machine]({{< relref "20211011005922-academic_machine.md" >}}).(especialy
)

<!--list-separator-->

-  1. Schedule

    Schedule the preview session **3 days before**
    that is to say, every day `check tutoring session after 3 days` and make preview task scheduled 1 day after.
    Or better, with each [Weekly Plan]({{< relref "20211011025228-weekly_plan.md" >}}) session, plan for the preview sessions of the week

    with Schedule, confirm on the content, type and method of studying. Best include the materials

<!--list-separator-->

-  2. Do self-study according to type and plan


#### content {#content}


#### procedure {#procedure}


#### fact {#fact}


#### Mixed {#mixed}

<!--list-separator-->

-  Programing

    <!--list-separator-->

    -  Programing Language